In [ ]:
#It is assumed that the mean systolic blood pressure is μ = 120 mm Hg. In the Honolulu Heart Study, 
#a sample of n = 100 people had an average systolic blood pressure of 130.1 mm Hg with a standard deviation of 
#21.21 mm Hg. Is the group significantly different (with respect to systolic blood pressure!) from the regular 
#population?

#Set up the hypothesis test.
#Write down all the steps followed for setting up the test.
#Calculate the test statistic by hand and also code it in Python. It should be 4.76190. 
#What decision can you make based on this calculated value?
#Hint: here is the statistic table

In [7]:
import numpy as np
import pandas as pd
import scipy.stats as stats
import matplotlib.pyplot as plt
import seaborn as sns
import math

%matplotlib inline

In [8]:
#H0: m = 120
#H1 m != 120


μ = 120 
n = 100
x = 130.1 
std = 21.21 

Z = (x-μ)/(std/math.sqrt(n))
Z

4.761904761904759

In [10]:
tc = stats.t.ppf(0.95, df=99)
tc

1.6603911559963895

In [ ]:
#reject

In [ ]:
#In a packing plant, a machine packs cartons with jars. It is supposed that a new machine will pack faster 
#on the average than the machine currently used. To test that hypothesis, the times it takes each machine to 
#pack ten cartons are recorded. The results, in seconds, are shown in the tables in the file Data/machine.txt. 
#Assume that there is sufficient evidence to conduct the t test, does the data provide sufficient evidence to 
#show if one machine is better than the other.
#Hint: use two sample t-test

#t= (sample_mean(x1) - sample_mean(x2)) / sqrt(square(s1)/n1 + square(s2)/n2 )

In [14]:
df = pd.read_fwf('Data_Machine.txt')
df

   New Machine   Old  Machine
0         42.1  42.7      NaN
1         41.0  43.6      NaN
2         41.3  43.8      NaN
3         41.8  43.3      NaN
4         42.4  42.5      NaN
5         42.8  43.5      NaN
6         43.2  43.1      NaN
7         42.3  41.7      NaN
8         41.8  44.0      NaN
9         42.7  44.1      NaN

In [21]:
pn_df = df.drop(['Machine'], axis =1)
pn_df

   New Machine   Old
0         42.1  42.7
1         41.0  43.6
2         41.3  43.8
3         41.8  43.3
4         42.4  42.5
5         42.8  43.5
6         43.2  43.1
7         42.3  41.7
8         41.8  44.0
9         42.7  44.1

In [25]:
tidy = pn_df.rename(columns = {"New Machine" : "New"})
tidy

    New   Old
0  42.1  42.7
1  41.0  43.6
2  41.3  43.8
3  41.8  43.3
4  42.4  42.5
5  42.8  43.5
6  43.2  43.1
7  42.3  41.7
8  41.8  44.0
9  42.7  44.1

In [31]:
new_mean = tidy.New.mean()
new_mean

42.14

In [30]:
new_std = tidy.New.std()
new_std

0.6834552736727638

In [28]:
old_mean = tidy.Old.mean()
old_mean

43.230000000000004

In [32]:
old_std = tidy.Old.std()
old_std

0.7498888806572157

In [ ]:
#t= (sample_mean(x1) - sample_mean(x2)) / sqrt(square(s1)/n1 + square(s2)/n2 )

In [36]:
t = (old_mean - new_mean) / np.sqrt((old_std** 2 /10) + (new_std** 2/10))
t

3.397230706117603